Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler
The Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler class handles the session store operations.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.Prefix
The session context prefix.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.Serializer
The serializer instance.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.basePath
The base path.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler class.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler class.
basePath: The base path.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.Load``1(System.String,System.Guid,``0@)
Loads the session data with the matching identifier.
The type of the state data.
context: The context.
identifier: The identifier.
state: The session data with the matching identifier, if any.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.Save(System.String,System.Guid,System.Object)
Saves the specified state using the specified identifier.
context: The context.
identifier: The identifier.
session: The session state.

Tekla.Structures.DirectManipulation.Adapter.Session.SessionHandler.GetFilePath(System.String,System.Guid,System.Boolean)
Gets the file path based on the identifier.
context: The context.
identifier: The identifier.
createDir: Whether to create directory if not exists.
Returns: The file path based on the identifier in the given context.